{
  "Steven Adams": "A dominant interior presence who excels at setting powerful screens, securing rebounds, and anchoring the paint with strength and positioning.",
  "Bam Adebayo": "A versatile center capable of switching across positions, facilitating offense from the high post, and providing elite interior and perimeter defense.",
  "Nickeil Alexander-Walker": "Skilled combo guard with smooth shooting mechanics, ability to create off the dribble, efficient scoring in isolation and pick-and-roll situations, floor-spacing gravity, and strong on-ball defensive instincts.",
  "Grayson Allen": "Reliable perimeter scorer with elite catch-and-shoot mechanics, off-ball movement, ability to space the floor, and consistent scoring from beyond the arc.",
  "Jarrett Allen": "Athletic rim-protecting center with elite timing, pick-and-roll finishing efficiency, lob receiving ability, strong offensive and defensive rebounding, and vertical finishing around the basket.",
  "Kyle Anderson": "High-IQ forward with elite vision, pick-and-roll facilitation, tempo control, off-ball cutting, spacing creation, and versatile scoring in isolation and post-up situations.",
  "Giannis Antetokounmpo": "Dominant forward with elite transition finishing, interior scoring, rim-running ability, ball-handling for a big, floor-spacing gravity, off-ball cutting, and playmaking for teammates in multiple offensive sets.",
  "Thanasis Antetokounmpo": "High-energy wing with elite defensive activity, off-ball movement, rim-finishing ability in transition, cutting, and athleticism to create scoring and spacing opportunities.",
  "OG Anunoby": "Premier two-way wing with elite perimeter defense, catch-and-shoot proficiency, off-ball cutting, floor-spacing gravity, and ability to guard multiple positions effectively.",
  "Ryan Arcidiacono": "Steady point guard with sharp fundamentals, efficient floor organization, pick-and-roll facilitation, off-ball movement, and reliable scoring in structured offensive sets.",
  "Deandre Ayton": "Physically gifted center with soft touch around the rim, strong rebounding instincts, pick-and-roll finishing, lob receiving, and interior scoring efficiency.",
  "Marvin Bagley III": "Explosive forward/center with transition scoring, rim-finishing ability, lob reception, offensive rebounding, and high-motor energy on both ends.",
  "Mo Bamba": "Long, mobile center with elite rim protection instincts, floor-spacing shooting touch, pick-and-roll roll efficiency, and vertical finishing in transition and paint.",
  "Harrison Barnes": "Consistent forward with polished shooting mechanics, off-ball movement, secondary playmaking, floor-spacing gravity, and defensive versatility across multiple positions.",
  "RJ Barrett": "Strong slashing wing with size and athleticism, ability to finish through contact, off-ball cutting, pick-and-roll scoring, and midrange creation.",
  "Will Barton": "Creative scoring guard with advanced off-the-dribble creation, finishing ability in transition and half-court, floor-spacing gravity, and secondary playmaking off penetration.",
  "Keita Bates-Diop": "Versatile forward with length, off-ball movement, pick-and-roll scoring, defensive switching ability, and efficiency as a cutter and floor-spacing option.",
  "Nicolas Batum": "Veteran forward with elite court vision, passing feel, catch-and-shoot proficiency, off-ball movement, floor-spacing gravity, and ability to facilitate secondary offense.",
  "Darius Bazley": "Athletic forward with defensive versatility, ability to guard multiple positions, floor-spacing shooting, cutting ability, and transition finishing.",
  "Bradley Beal": "Elite scoring guard with three-level scoring, smooth shot mechanics, advanced footwork, off-ball movement, pick-and-roll efficiency, and floor-spacing gravity.",
  "Malik Beasley": "High-volume perimeter shooter with elite catch-and-shoot mechanics, floor-spacing efficiency, off-ball movement, and ability to finish off screens.",
  "Davis Bertans": "Stretch forward with elite long-range shooting, quick release, pick-and-pop efficiency, floor-spacing gravity, and ability to move effectively off-ball.",
  "Patrick Beverley": "Physical perimeter defender with elite on-ball pressure, off-ball awareness, floor leadership, pick-and-roll defense, and ability to disrupt opposing ball-handlers.",
  "Khem Birch": "Strong interior player with elite defensive positioning, offensive rebounding, finishing near the basket, and efficient screen setting in pick-and-roll situations.",
  "Goga Bitadze": "Disciplined center with strong rim protection fundamentals, efficient finishing around the basket, interior positioning, and lob receiving ability.",
  "Bismack Biyombo": "Physical interior defender and rim protector with elite shot-blocking timing, rebounding instincts, and ability to set screens and roll effectively.",
  "Bogdan Bogdanovic": "Skilled combo guard with efficient shooting, advanced ball-handling, off-ball movement, pick-and-roll playmaking, and floor-spacing gravity.",
  "Bojan Bogdanovic": "Smooth-scoring forward with efficient catch-and-shoot shooting, smart off-ball movement, floor-spacing ability, and scoring versatility in motion and isolation.",
  "Bol Bol": "Uniquely skilled big with exceptional length, fluid ball-handling, perimeter shooting touch, rim-finishing ability, pick-and-roll efficiency, and floor-spacing gravity.",
  "Devin Booker": "Elite scoring guard with advanced shot creation, off-the-dribble finishing, floor-spacing gravity, off-ball movement, and ability to create opportunities for teammates through pick-and-roll facilitation.",
  "Chris Boucher": "Mobile big with elite length, shot-blocking timing, rim-finishing ability, pick-and-roll efficiency, transition scoring, and offensive rebounding.",
  "Tony Bradley": "Traditional big with strong interior scoring, rebounding, screen setting, pick-and-roll efficiency, and finishing ability near the basket.",
  "Jarrell Brantley": "Physical forward with high-energy defense, offensive rebounding, pick-and-roll roll efficiency, and cutting ability to generate scoring opportunities.",
  "Mikal Bridges": "Elite two-way wing with consistent perimeter shooting, off-ball movement, defensive versatility, floor-spacing gravity, and transition finishing ability.",
  "Miles Bridges": "Explosive athletic wing with elite slashing ability, rim-finishing, transition scoring, pick-and-roll effectiveness, and off-ball movement to create spacing.",
  "Oshae Brissett": "High-motor forward with defensive versatility, rebounding, pick-and-roll scoring, transition finishing, and off-ball movement to generate spacing.",
  "Malcolm Brogdon": "Poised scoring guard with elite efficiency, advanced shot creation, pick-and-roll facilitation, off-ball movement, floor-spacing, and secondary playmaking ability.",
  "Dillon Brooks": "Strong two-way wing with on-ball defense, physical scoring through contact, off-ball cutting, pick-and-roll finishing, and transition aggression.",
  "Bruce Brown": "Versatile two-way player with ability to defend multiple positions, off-ball cutting, transition finishing, secondary playmaking, and pick-and-roll scoring.",
  "Charlie Brown Jr.": "Athletic guard with reliable perimeter shooting mechanics, off-ball movement, defensive instincts, and pick-and-roll scoring efficiency.",
  "Jaylen Brown": "Powerful athletic wing with elite slashing ability, finishing through contact, off-ball cutting, transition scoring, and secondary playmaking off penetration.",
  "Moses Brown": "Long physical center with elite rebounding, rim protection, pick-and-roll finishing, lob receiving, and transition scoring.",
  "Sterling Brown": "Reliable 3-and-D wing with catch-and-shoot efficiency, off-ball movement, defensive positioning, and floor-spacing gravity.",
  "Troy Brown Jr.": "Versatile wing with defensive versatility, off-ball cutting, rebounding, floor-spacing shooting, and pick-and-roll scoring.",
  "Jalen Brunson": "Composed floor general with elite footwork, midrange scoring, pick-and-roll facilitation, off-ball movement, floor-spacing efficiency, and advanced playmaking control.",
  "Thomas Bryant": "Efficient scoring center with soft touch, midrange shooting, pick-and-roll roll efficiency, floor-spacing gravity, and finishing around the rim.",
  "Reggie Bullock": "Dependable 3-and-D wing with catch-and-shoot efficiency, off-ball awareness, floor-spacing gravity, and defensive versatility.",
  "Alec Burks": "Veteran combo guard with smooth shooting touch, off-ball movement, on-ball scoring, pick-and-roll facilitation, and secondary playmaking.",
  "Deonte Burton": "Physical guard with high-energy defense, athletic finishing, transition scoring, pick-and-roll effectiveness, and off-ball movement to create spacing.",
  "Jimmy Butler": "An elite two-way wing and floor leader who excels at creating his own shot, facilitating offense, and defending top perimeter threats. Thrives in isolation, post play, and late-game situations with high basketball IQ and control.",
  "Kentavious Caldwell-Pope": "A disciplined 3-and-D guard with reliable spot-up shooting, strong point-of-attack defense, and consistent off-ball movement within team schemes.",
  "Vlatko Cancar": "A versatile forward with good size, passing vision, and awareness in team defense and transition play.",
  "Clint Capela": "An elite rim protector and rebounder who anchors the paint, finishes efficiently in pick-and-roll, and controls the glass with strength and timing.",
  "Jevon Carter": "A defensive-minded guard with elite on-ball pressure, quick hands, and reliable spot-up shooting from the perimeter.",
  "Wendell Carter Jr.": "A mobile two-way big who combines rebounding, rim protection, and soft touch from midrange with high passing awareness in short-roll situations.",
  "Michael Carter-Williams": "A tall guard with good defensive instincts, solid passing vision, and the ability to facilitate offense from multiple positions.",
  "Alex Caruso": "An elite perimeter defender with exceptional help instincts, quick rotations, and high basketball IQ. Offensively a smart cutter and secondary playmaker.",
  "Brandon Clarke": "An explosive forward who finishes efficiently as a cutter and lob target, defends multiple positions, and provides rim protection with great timing.",
  "Jordan Clarkson": "A dynamic scoring guard who creates shots off the dribble, excels in isolation and pull-up situations, and provides instant offense as a spark plug.",
  "Nic Claxton": "A mobile rim protector with excellent switching ability, vertical finishing, and strong defensive coverage across multiple positions.",
  "Amir Coffey": "A long, versatile wing who provides spacing, cutting, and perimeter defense while playing multiple guard and forward roles.",
  "John Collins": "A powerful, athletic forward who spaces the floor as a pick-and-pop threat, finishes lob plays, and rebounds effectively on both ends.",
  "Zach Collins": "A skilled big man with solid touch from midrange and three, plus mobility to defend in space and protect the rim.",
  "Mike Conley": "A veteran point guard with elite decision-making, pick-and-roll control, and precise passing. Maintains high efficiency with off-ball shooting and steady leadership.",
  "Pat Connaughton": "An athletic 3-and-D wing who spaces the floor, cuts intelligently, and provides energy and rebounding from the guard position.",
  "Robert Covington": "A switchable defender with excellent length, anticipation, and help-side rim protection, while spacing the floor as a consistent catch-and-shoot forward.",
  "Torrey Craig": "A defensive-minded wing with strong on-ball defense, rebounding effort, and reliable corner shooting.",
  "Jae Crowder": "A physical forward who provides leadership, strong positional defense, and consistent spot-up shooting from deep.",
  "Jarrett Culver": "A tall, athletic guard with defensive versatility and solid open-floor playmaking ability.",
  "Seth Curry": "An elite perimeter shooter with quick release, off-ball movement, and efficient scoring off screens and spot-ups.",
  "Stephen Curry": "A super efficient and crafty guard with deep shooting range, elite off-ball movement, and advanced playmaking vision. Creates spacing gravity that transforms team offenses.",
  "Anthony Davis": "A dominant two-way big with elite rim protection, switch defense, and versatile scoring from post, midrange, and transition. Controls the paint on both ends.",
  "Terence Davis": "An athletic guard who excels in transition, spot-up shooting, and attacking closeouts with energy and finishing ability.",
  "DeMar DeRozan": "A skilled mid-range scorer with excellent footwork, post-up ability, and strong playmaking as a secondary facilitator.",
  "Dewayne Dedmon": "A traditional center who rebounds well, defends the paint, and provides efficient scoring in pick-and-roll situations.",
  "Matthew Dellavedova": "A scrappy guard known for defensive effort, high basketball IQ, and reliable game management in structured offensive sets.",
  "Donte DiVincenzo": "A high-energy combo guard who spaces the floor, rebounds well for his size, and defends aggressively on the perimeter.",
  "Mamadi Diakite": "A long, athletic forward with shot-blocking instincts, rebounding strength, and developing touch as a finisher.",
  "Hamidou Diallo": "An explosive wing who attacks the rim in transition, rebounds well for his position, and defends with physicality.",
  "Gorgui Dieng": "A veteran big with solid defensive positioning, midrange shooting ability, and strong passing vision from the high post.",
  "Spencer Dinwiddie": "A creative guard with size who excels at pick-and-roll playmaking, midrange shot creation, and tempo control.",
  "Luka Doncic": "A fantastic playmaker and scorer with elite vision, ball-handling, and shot creation from all levels. With super pick-and-roll ability controls pace, manipulates defenses, and directs offense",
  "Tyler Dorsey": "A smooth perimeter shooter with quick release, good spacing instincts, and solid off-ball movement.",
  "Luguentz Dort": "A premier on-ball defender who guards elite scorers across positions while providing reliable catch-and-shoot offense.",
  "PJ Dozier": "A lengthy guard with defensive versatility, solid playmaking instincts, and transition finishing ability.",
  "Goran Dragic": "A veteran point guard with strong pick-and-roll craft, scoring touch, and playmaking control in half-court sets.",
  "Andre Drummond": "A dominant rebounder and interior finisher who controls the paint with strength, screens, and rim-running ability.",
  "Kris Dunn": "A defensive guard with quick hands, lateral speed, and on-ball pressure who initiates offense effectively in transition.",
  "Kevin Durant": "A super efficient scorer (clutch player) with elite shooting efficiency, advanced handle, and unmatched shot creation from all three levels. Provides strong rim protection and defensive versatility for his size.",
  "Anthony Edwards": "A high-level scoring wing with explosive athleticism, strength, and an excellent shot creation. Excellent in transition and on-ball defense.",
  "Joel Embiid": "A dominant two-way center with elite post scoring, midrange shooting, and interior defense. Controls tempo, spacing, and rim protection as a franchise anchor.",
  "Drew Eubanks": "A high-energy big who screens hard, rebounds with effort, and finishes efficiently around the rim.",
  "Dante Exum": "A long, athletic guard who defends multiple positions and contributes as a secondary playmaker and transition threat.",
  "Bruno Fernando": "A powerful interior player with strong rebounding, rim finishing, and shot-blocking instincts.",
  "Dorian Finney-Smith": "A two-way forward who excels as a perimeter defender, rebounder, and consistent catch-and-shoot option from deep.",
  "Malachi Flynn": "A quick, skilled point guard with reliable three-point shooting, sharp pick-and-roll decision-making, and efficient ball movement.",
  "Bryn Forbes": "A specialist shooter with elite accuracy from deep, quick release, and strong off-ball movement to create spacing.",
  "Trent Forrest": "A strong, defensive-minded guard with good size, discipline, and playmaking vision. Provides on-ball pressure and secondary ball-handling support.",
  "Evan Fournier": "A smooth perimeter scorer with strong off-ball movement, catch-and-shoot efficiency, and ability to create off screens.",
  "De'Aaron Fox": "An elite speed guard with exceptional burst, downhill scoring, and midrange pull-up accuracy. Excels in transition and pick-and-roll creation.",
  "Markelle Fultz": "A crafty slashing guard with elite body control, strong finishing through contact, and advanced passing instincts.",
  "Wenyen Gabriel": "A high-energy forward with rebounding presence, rim protection, and mobility to defend multiple frontcourt spots.",
  "Daniel Gafford": "An explosive rim runner with elite vertical finishing, shot-blocking, and interior defense. Strong roll man in pick-and-roll actions.",
  "Danilo Gallinari": "Versatile stretch forward with elite shooting from midrange and three-point range, capable of spacing the floor effectively. Can create off the catch or off the dribble, draw fouls consistently, and convert efficiently in pick-and-pop and isolation situations. Provides off-ball movement and cutting to enhance team spacing and offensive flow.",
  "Darius Garland": "A quick, creative point guard with elite handle, deep shooting range, and advanced passing in pick-and-roll situations.",
  "Rudy Gay": "Versatile forward with midrange and catch-and-shoot scoring ability, capable of creating off the dribble and finishing in transition. Can stretch the floor with spacing, move effectively off-ball, and contribute as a cutter. Provides solid defensive positioning, can switch onto multiple positions, and offers help-side awareness.",
  "Paul George": "An elite two-way wing with smooth shot creation, defensive versatility, and advanced scoring across all three levels.",
  "Taj Gibson": "A physical interior defender and strong rebounder who provides screens, toughness, and efficient finishing near the rim.",
  "Harry Giles": "A mobile big with soft touch, passing feel, and rebounding instincts. Can finish with both hands around the basket.",
  "Shai Gilgeous-Alexander": "A composed lead guard with elite footwork, slashing ability, and midrange scoring efficiency. Controls pace and creates consistently off drives.",
  "Anthony Gill": "Versatile forward who can finish efficiently around the rim, space the floor with catch-and-shoot ability, and rotate effectively on defense.",
  "Rudy Gobert": "Elite rim protector and rebounder who anchors the paint, controls defensive positioning, and converts efficiently as a lob target.",
  "Aaron Gordon": "Athletic forward with switchable defense, excels in transition scoring, rim finishing, and cutting to create offensive opportunities.",
  "Eric Gordon": "Scoring guard with deep shooting range, off-ball movement, and the ability to attack closeouts and finish in transition.",
  "Devonte' Graham": "Quick guard with deep shooting range, high pick-and-roll activity, and reliable off-ball movement for spacing and catch-and-shoot opportunities.",
  "Jerami Grant": "Long, athletic forward with perimeter shooting, transition scoring, and defensive versatility across multiple positions.",
  "Danny Green": "Specialized 3-and-D wing with elite catch-and-shoot efficiency, off-ball movement, and disciplined team defense.",
  "Draymond Green": "Elite defensive playmaker with anticipation, switching ability, rim protection, and playmaking as a short-roll facilitator and primary passer.",
  "JaMychal Green": "Versatile stretch forward with corner three-point shooting, efficient floor spacing, strong rebounding, and ability to finish in the paint. Can roll in pick-and-pop situations and cut off-ball to create scoring opportunities.",
  "Javonte Green": "Explosive wing with high-energy defense, perimeter activity, transition scoring, cutting ability, and finishing above the rim in open-court and pick-and-roll scenarios.",
  "Jeff Green": "Versatile forward with size and athleticism, capable of finishing at the rim, spacing the floor with catch-and-shoot ability, cutting off-ball, and contributing as a secondary playmaker in both isolation and team sets.",
  "Josh Green": "Athletic wing with strong perimeter defense, cutting ability, catch-and-shoot scoring from midrange and three-point range, and off-ball movement to generate spacing for teammates.",
  "Blake Griffin": "Skilled big with high passing IQ, pick-and-pop and pick-and-roll shooting, rim-finishing ability, lob receiving, off-ball movement, and capacity to create scoring opportunities in the interior.",
  "Rui Hachimura": "Forward with smooth midrange scoring, catch-and-shoot three-point ability, post-up scoring, off-ball cutting, and capability to attack mismatches in isolation and transition.",
  "Tyrese Haliburton": "Elite playmaking guard with advanced vision, efficient shooting, pick-and-roll control, off-ball movement to generate spacing, ability to read defenses, and creation for teammates in multiple offensive sets.",
  "R.J. Hampton": "Athletic combo guard with elite speed, slashing ability, finishing at the rim, transition scoring, and off-ball movement to exploit defensive rotations.",
  "Tim Hardaway Jr.": "Perimeter scorer with elite catch-and-shoot mechanics, quick release, off-ball movement, ability to score off screens, and spacing impact to open driving lanes for teammates.",
  "James Harden": "Elite offensive creator with advanced isolation scoring, step-back shooting, off-ball gravity to generate spacing, pick-and-roll mastery, and passing vision to create opportunities for multiple teammates.",
  "Montrezl Harrell": "High-motor interior scorer and rebounder with elite finishing around the rim, lob and pick-and-roll aggressiveness, transition scoring, and floor-spacing as a lob target.",
  "Gary Harris": "Two-way guard with reliable catch-and-shoot shooting, perimeter quickness, disciplined off-ball defense, and scoring efficiency in motion and catch-and-shoot situations.",
  "Joe Harris": "Elite catch-and-shoot specialist with deep three-point range, off-ball movement, ability to space the floor, and finishing off screens and in transition.",
  "Tobias Harris": "Smooth forward with midrange and perimeter scoring, consistent three-point shooting, off-ball cutting, size to attack mismatches, and floor-spacing impact for team offense.",
  "Shaquille Harrison": "Defensive-minded guard with length, lateral quickness, active on-ball pressure, off-ball awareness, and ability to create turnovers and transition scoring opportunities.",
  "Josh Hart": "Versatile guard/forward with elite rebounding for position, defensive toughness, transition playmaking, cutting ability, and off-ball spacing movement.",
  "Isaiah Hartenstein": "Skilled center with passing vision, high-post facilitation, rim protection, finishing efficiency around the basket, and offensive rebounding to generate second-chance points.",
  "Udonis Haslem": "Physical interior presence with elite rebounding fundamentals, defensive positioning, interior scoring efficiency, and leadership on both ends of the floor.",
  "Jaxson Hayes": "Athletic rim-running big with lob finishing, shot-blocking, verticality in transition and paint scoring, pick-and-roll roll efficiency, and off-ball movement to generate spacing.",
  "Killian Hayes": "Tall left-handed guard with advanced passing vision, midrange shooting, pick-and-roll facilitation, defensive activity, off-ball movement, and ability to generate spacing and opportunities for teammates.",
  "Gordon Hayward": "Versatile wing with catch-and-shoot efficiency, off-ball movement, secondary playmaking, floor-spacing gravity, and ability to create scoring opportunities for teammates off penetration or screens.",
  "Juancho Hernangomez": "Stretch forward with reliable catch-and-shoot ability, off-ball cutting, floor-spacing efficiency, and secondary playmaking through movement and screen usage.",
  "Willy Hernangomez": "Skilled interior scorer with soft touch, efficient post-up scoring, offensive rebounding, pick-and-roll finishing, and ability to space the floor as a roll target.",
  "Tyler Herro": "Creative scoring guard with elite shooting mechanics, off-the-dribble creation, floor-spacing gravity, secondary playmaking, and off-ball movement to generate open looks.",
  "Buddy Hield": "Premier three-point specialist with deep range, quick release, off-ball movement, spacing efficiency, and ability to finish off screens and in transition.",
  "Haywood Highsmith": "High-effort forward with defensive versatility, cutting ability, transition finishing, and corner shooting to space the floor.",
  "George Hill": "Veteran guard with efficient shooting, off-ball movement, perimeter defense, secondary playmaking, pick-and-roll facilitation, and floor-spacing gravity.",
  "Nate Hinton": "Defensive-minded guard with high motor, rebounding effort, on-ball pressure, off-ball movement, and transition scoring ability.",
  "Aaron Holiday": "Quick guard with tight handle, perimeter shooting, pick-and-roll facilitation, off-ball movement, and active defensive positioning.",
  "Jrue Holiday": "Elite two-way guard with ball-handling, passing vision, perimeter defense, finishing at the rim, off-ball movement, and ability to create spacing for teammates.",
  "Justin Holiday": "3-and-D wing with reliable perimeter defense, catch-and-shoot efficiency, off-ball movement, and floor-spacing impact.",
  "Richaun Holmes": "Athletic center with rim-running ability, shot-blocking, finishing in the paint, offensive rebounding, pick-and-roll finishing, and floor spacing as a lob target.",
  "Al Horford": "High-IQ big with elite defensive awareness, passing vision, floor-spacing shooting, pick-and-roll facilitation, ability to anchor team defense, and communication for rotations.",
  "Talen Horton-Tucker": "Versatile guard with creation ability, finishing at the rim, pick-and-roll efficiency, off-ball movement, and defensive switching capability.",
  "Danuel House Jr.": "3-and-D wing with perimeter defense, athleticism, catch-and-shoot scoring, off-ball cutting, and floor-spacing efficiency.",
  "Kevin Huerter": "Shooting guard with elite perimeter mechanics, off-ball movement, secondary playmaking skills, catch-and-shoot efficiency, and spacing gravity.",
  "De'Andre Hunter": "Two-way forward with on-ball defense, midrange scoring, off-ball movement, cutting ability, and ability to guard multiple positions effectively.",
  "Serge Ibaka": "Veteran rim protector with defensive timing, pick-and-pop spacing, midrange shooting, floor-spacing, and shot-altering ability in help defense.",
  "Andre Iguodala": "Defensive playmaker with passing vision, transition finishing, off-ball cutting, floor-spacing, and ability to create scoring opportunities for teammates.",
  "Joe Ingles": "Crafty forward with elite passing, floor spacing, off-ball movement, pick-and-roll creation, and ability to facilitate scoring opportunities efficiently.",
  "Brandon Ingram": "A tall, skilled forward with elite midrange scoring, smooth handle, and advanced shot creation. Excellent in isolation and improving as a playmaker.",
  "Kyrie Irving": "An elite offensive guard with exceptional ball-handling, finishing craft, and deep shooting range. Excels in isolation, pick-and-roll creation, and clutch scoring.",
  "Jonathan Isaac": "A long, athletic forward with elite defensive versatility, rim protection, and switchability across multiple positions. Provides transition finishing and secondary rebounding.",
  "Frank Jackson": "An explosive scoring guard with quick first step, strong driving ability, and off-ball shooting capability.",
  "Jaren Jackson Jr.": "A mobile stretch big with elite rim protection, lateral agility, and perimeter shooting. Excels in switch defense and floor spacing.",
  "Justin Jackson": "A tall wing with consistent shooting mechanics, good off-ball movement, and floor spacing value in catch-and-shoot situations.",
  "Reggie Jackson": "A veteran scoring guard with confident shot creation, pull-up shooting, and solid pick-and-roll execution.",
  "LeBron James": "A generational playmaker with elite strength, vision, and versatility (clutch player). Dominates as a passer, scorer, and defender in multiple roles.",
  "DaQuan Jeffries": "A strong wing defender with physicality, rebounding presence, and ability to attack the rim in transition.",
  "Ty Jerome": "A high-IQ guard with elite shooting accuracy, smart playmaking, and efficient decision-making in half-court sets.",
  "Isaiah Joe": "A perimeter shooter with quick release, deep range, and off-ball movement. Adds spacing and catch-and-shoot reliability.",
  "Alize Johnson": "A high-energy forward who rebounds at an elite rate, runs the floor effectively, and finishes efficiently near the rim.",
  "Cameron Johnson": "A sharpshooting forward with elite catch-and-shoot efficiency, solid team defense, and smart off-ball cutting.",
  "James Johnson": "A strong, versatile forward with defensive toughness, handling ability, and transition finishing. Provides physical presence and switch defense.",
  "Keldon Johnson": "A powerful wing with downhill driving, rebounding, and finishing through contact. Brings energy and physicality in both ends.",
  "Stanley Johnson": "A defensive wing with strong body control, physical perimeter defense, and ability to guard multiple positions.",
  "Nikola Jokic": "An elite passing center with unmatched court vision, touch, and scoring efficiency. Controls tempo and facilitates offense through post and high-screen actions.",
  "Damian Jones": "An athletic center with elite rim protection, verticality for shot-blocking, efficient lob finishing, and strong rebounding presence.",
  "Derrick Jones Jr.": "An explosive wing with elite defensive versatility, rim protection from the perimeter, transition finishing, and high-flying slashing ability.",
  "Mason Jones": "A physical scoring guard with advanced shot creation, ability to generate contact at the rim, and efficient finishing in multiple scoring scenarios.",
  "Tre Jones": "A steady point guard with elite floor control, on-ball defensive activity, efficient decision-making, and mastery in tempo management and pick-and-roll execution.",
  "Tyus Jones": "A composed floor general with elite assist-to-turnover ratio, precise midrange control, smart pick-and-roll facilitation, and efficient off-ball movement.",
  "DeAndre Jordan": "A veteran center with elite rim protection, rebounding dominance, efficient lob finishing, and interior positioning to control the paint.",
  "Cory Joseph": "A reliable floor general with efficient ball movement, on-ball defensive activity, game management expertise, and veteran leadership in orchestrating team offense.",
  "Mfiondu Kabengele": "A mobile forward/center with rim protection, energy for transition finishing, verticality for lob opportunities, and strong interior presence.",
  "Frank Kaminsky": "A stretch big with elite midrange and three-point shooting, advanced passing vision, pick-and-pop effectiveness, and floor-spacing ability.",
  "Luke Kennard": "An elite perimeter shooter with quick release, efficient off-ball movement, secondary playmaking, and spacing gravity for team offense.",
  "Maxi Kleber": "A two-way stretch forward with reliable three-point shooting, rim protection, switchable defense, and positional awareness in team schemes.",
  "Nathan Knight": "A strong interior player with effective rebounding, post finishing, physical screening, and energy-driven play around the rim.",
  "Kevin Knox": "A tall forward with smooth perimeter shooting mechanics, catch-and-shoot efficiency, and floor-spacing ability from multiple levels.",
  "John Konchar": "A high-IQ guard with strong rebounding for size, efficient shooting, disciplined defensive positioning, and smart off-ball movement.",
  "Furkan Korkmaz": "A confident wing shooter with elite catch-and-shoot ability, movement off screens, spacing gravity, and off-ball cutting instincts.",
  "Luke Kornet": "A stretch center with reliable three-point shooting, rim protection timing, interior defensive positioning, and pick-and-pop spacing ability.",
  "Kyle Kuzma": "A versatile scoring forward with shot creation, rebounding strength, cutting ability, and defensive awareness in multiple matchups.",
  "Zach LaVine": "An elite athletic guard with explosive finishing at the rim, smooth jump shot, advanced driving ability, and off-ball movement for spacing.",
  "Anthony Lamb": "A strong forward with reliable perimeter shooting, efficient rebounding, positional defense, and off-ball cutting capability.",
  "Romeo Langford": "A long, athletic guard with slashing ability, defensive versatility, transition scoring, and off-ball movement to create spacing opportunities.",
  "Caris LeVert": "A creative scoring wing with advanced ball-handling, midrange efficiency, penetration-based playmaking, and transition finishing.",
  "Damion Lee": "A reliable spot-up shooter with intelligent off-ball movement, floor-spacing efficiency, and transition scoring capability.",
  "Saben Lee": "A quick, athletic guard with explosive drives, rim pressure, transition scoring, and defensive activity on-ball and in rotations.",
  "Alex Len": "A big-bodied center with rim protection, elite interior rebounding, efficient finishing around the basket, and post presence.",
  "Kawhi Leonard": "An elite two-way forward with exceptional midrange scoring, off-ball movement, perimeter defense, and ability to create and finish in isolation.",
  "Meyers Leonard": "A stretch center with reliable shooting mechanics, pick-and-pop efficiency, interior presence, and floor-spacing ability.",
  "Kira Lewis Jr.": "A speedy guard with elite acceleration, effective slashing ability, transition finishing, and off-ball movement to generate spacing.",
  "Damian Lillard": "An elite scoring guard with deep shooting range, clutch shot-making, pick-and-roll command, off-ball movement, and floor-spacing gravity.",
  "Nassir Little": "An athletic wing with strong defensive versatility, rebounding activity, transition finishing, and off-ball movement to create scoring opportunities.",
  "Kevon Looney": "A fundamentally sound big with elite rebounding, defensive positioning, screening ability, and team defense communication.",
  "Brook Lopez": "A veteran center with elite rim protection, floor-spacing shooting, pick-and-roll drop coverage, and team defensive awareness.",
  "Robin Lopez": "A traditional big with interior scoring touch, effective screening, positional paint defense, and rebounding activity.",
  "Kevin Love": "A skilled forward/center with elite rebounding, floor-spacing shooting, outlet passing vision, and catch-and-shoot efficiency.",
  "Kyle Lowry": "A veteran point guard with elite playmaking, perimeter defense, leadership, pace control, and half-court offensive orchestration.",
  "Trey Lyles": "A stretch forward with consistent perimeter shooting, physical interior play, rebounding, and off-ball movement to generate spacing.",
  "Theo Maledon": "A tall point guard with good vision, ball control, half-court composure, and pick-and-roll facilitation.",
  "Terance Mann": "A versatile guard/forward with defensive switchability, slashing ability, transition finishing, and off-ball cutting skills.",
  "Boban Marjanovic": "A towering center with elite finishing around the rim, rebounding dominance, interior scoring efficiency, and screen setting.",
  "Lauri Markkanen": "A versatile stretch forward with elite shooting for size, off-ball cutting, rebounding efficiency, and ability to attack closeouts.",
  "Naji Marshall": "A physical wing with defensive toughness, slashing capability, high-energy rebounding, and effective transition play.",
  "Caleb Martin": "A two-way forward with athleticism, defensive versatility, off-ball movement, and improved catch-and-shoot shooting efficiency.",
  "Cody Martin": "A defensive-minded wing with high IQ, hustle, secondary playmaking in half-court and transition, and off-ball movement.",
  "KJ Martin": "An explosive forward with vertical finishing ability, high-energy rebounding, cutting instincts, and transition scoring effectiveness.",
  "Garrison Mathews": "A confident perimeter shooter with deep range, quick release, and ability to draw fouls on closeouts. Competes with high energy on defense and provides spacing value.",
  "Wesley Matthews": "A veteran 3-and-D wing with strong defensive fundamentals, physicality, and reliable corner shooting. Brings leadership and toughness to perimeter rotations.",
  "Tyrese Maxey": "An explosive scoring guard with elite speed, finishing ability, and shooting touch. Excellent in transition, off-the-dribble creation, and improving playmaking reads.",
  "Skylar Mays": "A composed combo guard with smart decision-making, efficient shooting, and control in half-court sets. Uses footwork and vision to stabilize bench units.",
  "CJ McCollum": "A smooth scoring guard with elite midrange shooting, advanced handle, and off-ball movement. Creates efficiently from pick-and-roll and isolation situations.",
  "T.J. McConnell": "A high-energy point guard with elite hustle, anticipation on defense, and strong playmaking in short-roll actions. Excellent in generating steals and tempo control.",
  "Jaden McDaniels": "A long, athletic forward with elite defensive instincts, switchability, and rim protection. Offensively contributes with spot-up shooting and transition finishing.",
  "Jalen McDaniels": "A versatile forward with strong cutting instincts, defensive mobility, and rebounding activity. Provides spacing and energy in hybrid forward roles.",
  "Doug McDermott": "An elite movement shooter with quick release, off-screen scoring, and spatial awareness. Excels at floor spacing and creating gravity in half-court offense.",
  "JaVale McGee": "A vertical rim protector and lob finisher with elite shot-blocking timing. Provides energy, rebounding, and interior defense presence.",
  "Rodney McGruder": "A steady veteran guard who defends well on the perimeter, moves intelligently off the ball, and spaces the floor as a reliable spot-up shooter.",
  "Jordan McLaughlin": "A cerebral point guard with sharp playmaking instincts, ball control, and defensive effort. Excellent at initiating offense and facilitating tempo.",
  "De'Anthony Melton": "A two-way guard with elite defensive hands, transition play, and improved perimeter shooting. Brings energy, switchability, and off-ball pressure.",
  "Sam Merrill": "A pure shooter with elite mechanics, movement efficiency, and floor-spacing ability. Contributes with smart positioning and off-ball activity.",
  "Chimezie Metu": "A mobile forward/center with athletic finishing, rim protection, and rebounding ability. Adds versatility with midrange touch and switch defense.",
  "Khris Middleton": "A polished wing scorer with smooth shooting, midrange mastery, and playmaking ability. Defensively disciplined and effective in structured systems.",
  "Patty Mills": "A veteran guard with elite perimeter shooting, quick release, and high basketball IQ. Provides energy, off-ball movement, and veteran leadership.",
  "Shake Milton": "A tall combo guard with scoring versatility, fluid jumper, and solid secondary playmaking. Comfortable creating from pick-and-roll or isolation.",
  "Donovan Mitchell": "An elite scoring guard with explosive first step, advanced shot creation, and defensive strength. Dominant in isolation and clutch scoring scenarios.",
  "Malik Monk": "A high-energy guard with elite shooting confidence, athleticism, and creation ability. Excels in transition, off-ball scoring, and secondary playmaking.",
  "Ja Morant": "An explosive playmaking guard with elite speed, body control, and finishing at the rim. Generates offense through transition and creative pick-and-roll execution.",
  "Marcus Morris": "A physical forward with consistent midrange shooting, post scoring, and defensive toughness. Effective as a stretch-four with rebounding strength.",
  "Markieff Morris": "A veteran big forward with interior strength, defensive versatility, and reliable catch-and-shoot spacing. Brings physicality and experience to frontcourt rotations.",
  "Monte Morris": "A composed point guard with exceptional turnover control, efficient shooting, and steady leadership. Executes offense with precision and poise.",
  "Dejounte Murray": "A long, athletic guard with elite rebounding, midrange control, and defensive impact. Creates off the dribble and guards multiple positions effectively.",
  "Jamal Murray": "A dynamic scoring guard with elite shooting off movement, advanced footwork, and composure under pressure. Excellent pick-and-roll execution and off-ball play.",
  "Mike Muscala": "A floor-spacing big with smooth perimeter shooting, smart rotations, and strong understanding of team defense. Adds veteran reliability and spacing versatility.",
  "Svi Mykhailiuk": "A skilled wing with shooting range, secondary playmaking, and fluid movement off the ball. Effective in motion offense and spot-up situations.",
  "Larry Nance Jr.": "An athletic forward/center with elite defensive switchability, vertical finishing, and high IQ passing. Adds energy, rebounding, and rim protection.",
  "Aaron Nesmith": "A physical 3-and-D wing with defensive tenacity, shooting range, and strong motor. Excels at closing out, contesting shots, and cutting off-ball.",
  "Raul Neto": "A veteran point guard with strong defensive fundamentals, playmaking control, and composure under pressure. Executes efficiently within structured systems.",
  "Georges Niang": "A stretch forward with elite catch-and-shoot efficiency, high IQ movement, and smart spacing. Plays strong team defense and contributes to ball circulation.",
  "Zeke Nnaji": "A mobile big with rebounding ability, midrange touch, and defensive switch potential. Provides hustle, rim finishing, and positional versatility.",
  "Nerlens Noel": "A long, athletic rim protector with elite shot-blocking instincts, vertical spacing, and rebounding presence. Excels in defensive coverage and transition plays.",
  "Jaylen Nowell": "A scoring guard with downhill aggression, strong finishing, and midrange touch. Creates offense off penetration and brings energy off the bench.",
  "Frank Ntilikina": "A tall, disciplined defender with length, anticipation, and versatility to guard multiple positions. Facilitates offense with composure and spacing awareness.",
  "Kendrick Nunn": "A confident scoring guard with smooth jumper, quick first step, and shot creation ability. Provides instant offense and rhythm shooting in rotations.",
  "Jusuf Nurkic": "A powerful center with strong post presence, rebounding, and playmaking from the high post. Excellent screener and interior finisher.",
  "Jordan Nwora": "A smooth wing shooter with range, size, and scoring versatility. Adds spacing, shot creation, and rebounding from the perimeter.",
  "Royce O'Neale": "A defensive specialist with strong positional awareness, rebounding, and consistent perimeter shooting. Provides toughness and versatility in switch-heavy schemes.",
  "Chuma Okeke": "A versatile forward with excellent defensive timing, rebounding, and emerging three-point touch. Contributes in transition and as a spot-up shooter.",
  "Josh Okogie": "A high-energy defender with elite lateral quickness, strength, and hustle. Effective on-ball stopper who pressures passing lanes and attacks the rim.",
  "Onyeka Okongwu": "A mobile big with elite defensive instincts, rim protection, and switch agility. Finishes efficiently as a roller and rebounder.",
  "Isaac Okoro": "A strong wing defender with elite on-ball pressure, physical strength, and cutting ability. Contributes with hustle, drives, and team defense.",
  "KZ Okpala": "A long, athletic forward with defensive versatility, rebounding effort, and transition finishing. Effective in switch coverage and off-ball movement.",
  "Victor Oladipo": "A two-way guard with defensive instincts, explosive first step, and secondary playmaking ability. Strong in transition and perimeter containment.",
  "Kelly Olynyk": "A skilled big with elite floor spacing, passing feel, and pick-and-pop scoring. Provides offensive versatility and intelligent team defense.",
  "Cedi Osman": "A versatile forward with energy, cutting instincts, and transition finishing. Adds spacing and secondary playmaking value.",
  "Kelly Oubre Jr.": "An athletic wing with strong slashing, transition scoring, and defensive intensity. Active on cuts and effective guarding multiple positions.",
  "Chris Paul": "An elite guard with exceptional IQ, excellent pick-and-roll and superb vision. Midrange mastery. Directs offense with precision and applies defensive pressure effectively.",
  "Cameron Payne": "A fast-paced guard with quick handle, strong pull-up shooting, and energy off the bench. Pushes tempo and contributes to spacing.",
  "Gary Payton II": "An elite on-ball defender with quick hands, anticipation, and athletic finishing. Contributes through hustle, cutting, and secondary playmaking.",
  "Theo Pinson": "A team-oriented wing with leadership presence, communication skills, and defensive versatility. Adds value through energy and adaptability.",
  "Mason Plumlee": "A mobile, high-IQ big with elite passing for his size, rebounding strength, and screen-setting ability. Finishes efficiently and defends the paint.",
  "Jakob Poeltl": "A traditional center with elite rim protection, screening, and interior finishing. Excellent defensive communicator and rebounder.",
  "Aleksej Pokusevski": "A tall, skilled forward with shooting range, passing creativity, and coordination. Brings unique versatility with ball-handling and floor spacing.",
  "Jordan Poole": "A dynamic scoring guard with deep range, advanced shot creation, and quick first step. Effective in transition and off-ball scoring actions.",
  "Jontay Porter": "A skilled forward/center with touch, vision, and floor-spacing potential. Provides intelligent passing and rebounding fundamentals.",
  "Kevin Porter Jr.": "A creative scoring guard with elite handle, shot creation, and finishing ability. Generates offense off isolation and pick-and-roll play.",
  "Michael Porter Jr.": "A tall, smooth forward with elite shooting touch, off-ball movement, and rebounding ability. Provides efficient scoring and spacing for high-level offenses.",
  "Otto Porter Jr.": "A veteran forward with elite positional awareness, perimeter shooting, and defensive discipline. Excels in spacing and off-ball efficiency.",
  "Bobby Portis": "A high-energy forward with strong rebounding, midrange shooting, and physical interior play. Brings toughness and scoring from the frontcourt.",
  "Kristaps Porzingis": "A skilled 7-footer with elite shooting range, rim protection, and interior scoring. Provides spacing, shot-blocking, and mismatch creation.",
  "Dwight Powell": "A high-effort big with elite rim-running, screening, and vertical spacing. Adds defensive activity and finishing consistency in pick-and-roll actions.",
  "Norman Powell": "A strong scoring guard with efficient three-point shooting, attacking ability, and transition finishing. Defends physically and spaces the floor.",
  "Taurean Prince": "A two-way forward with perimeter defense, spot-up shooting, and rebounding toughness. Plays efficiently within team structure.",
  "Payton Pritchard": "A confident point guard with deep shooting range, off-ball movement, and playmaking control. Provides spacing and tempo management.",
  "Immanuel Quickley": "Energetic guard with excellent floater and pull-up scoring. Can create shots off the dribble and attack closeouts efficiently.",
  "Jahmi'us Ramsey": "Athletic guard with slashing ability and finishing at the rim. Can defend multiple positions and contribute on transition.",
  "Julius Randle": "Power forward with strong scoring versatility, handles the ball well for his size, and can finish inside and from midrange. Effective as a screener and in pick-and-roll actions.",
  "Cam Reddish": "Forward with smooth shooting touch, spacing ability, and defensive versatility. Can attack the rim in transition and rotate defensively across wings.",
  "Davon Reed": "Wing shooter with catch-and-shoot range and perimeter defensive ability. Can move off the ball and cut to the basket efficiently.",
  "Paul Reed": "Forward with elite energy, rebounding, rim protection, and athletic finishing around the basket. Effective in transition and pick-and-roll coverage.",
  "Naz Reid": "Forward/center with soft touch, scoring versatility inside and midrange, and mobility to protect the rim and help in team defense.",
  "Nick Richards": "Athletic big with rim protection, finishing ability around the basket, and effective rebounding positioning. Can roll in pick-and-rolls and protect paint defensively.",
  "Josh Richardson": "Wing with versatile on-ball and help defense, solid catch-and-shoot ability, and off-ball movement for spacing. Can cut efficiently and defend multiple positions.",
  "Austin Rivers": "Combo guard capable of scoring off the catch or drive, plays solid perimeter defense, and can navigate screens efficiently.",
  "Duncan Robinson": "Elite catch-and-shoot guard with deep range and spacing impact. Moves well off the ball and sets effective screens for teammates.",
  "Jerome Robinson": "Guard with shooting range and floor spacing ability. Can move without the ball and finish at the rim in transition.",
  "Mitchell Robinson": "Athletic center with elite rim protection, shot-blocking, and lob-finishing. Efficient in pick-and-roll rolls and defensive rotations.",
  "Isaiah Roby": "Forward with spacing ability, perimeter shooting, and versatility to switch defensively. Can finish at the rim and contribute on rebounds.",
  "Derrick Rose": "Guard with elite craft in midrange scoring, pull-up ability, and attacking the basket. Effective in pick-and-rolls and transition scoring.",
  "Terrence Ross": "Athletic wing with catch-and-shoot proficiency, ability to score off the dribble, and defensive versatility in perimeter rotations.",
  "Terry Rozier": "Scoring guard with pull-up shooting, off-ball movement, and ability to create in isolation or pick-and-roll. Effective in transition and late-game situations.",
  "Ricky Rubio": "Point guard with elite vision, passing, and tempo control. Can facilitate offense efficiently and provide perimeter defense and help rotations.",
  "D'Angelo Russell": "Guard with smooth shooting, creation off the dribble, and playmaking flair. Can space the floor and facilitate for teammates effectively.",
  "Domantas Sabonis": "Big with elite passing, scoring versatility, rebounding, and pick-and-roll finishing. Can defend in team concepts and provide interior help.",
  "Luka Samanic": "Forward with shooting touch, mobility, and spacing ability. Can roll in pick-and-rolls and switch on perimeter defense.",
  "Dario Saric": "Forward with passing skills, floor spacing, and catch-and-shoot range. Can rebound effectively and defend multiple positions in team schemes.",
  "Admiral Schofield": "Physical wing with defensive versatility, effort in rotations, and off-ball cutting. Can spot up for perimeter shots and crash the boards.",
  "Dennis Schroder": "Point guard with quick drives, pick-and-roll execution, and perimeter defense. Can score in transition and create off the bounce.",
  "Collin Sexton": "Explosive guard with strong midrange scoring, attacking the rim, and finishing through contact. Can move off-ball and create pick-and-roll opportunities.",
  "Landry Shamet": "Shooting guard with deep range, off-ball movement, and spacing ability. Effective in catch-and-shoot situations and cutting off screens.",
  "Pascal Siakam": "Forward/center with mobility, midrange shooting, pick-and-roll finishing, and passing for his size. Can switch defensively and protect the rim in help schemes.",
  "Chris Silva": "Forward with rebounding, athletic finishing, and defensive energy. Can roll in pick-and-rolls and provide help defense in the paint.",
  "Ben Simmons": "Guard/forward with elite playmaking, transition scoring, defensive versatility, and ability to guard multiple positions. Can initiate offense and finish at the rim efficiently.",
  "Kobi Simmons": "Athletic guard with slashing ability, finishing at the rim, and perimeter defense. Can space floor with occasional off-ball shooting.",
  "Anfernee Simons": "Scoring guard with deep range, pull-up shooting, and smooth handle. Can create off the dribble and finish in transition or isolation.",
  "Marcus Smart": "Guard with elite perimeter defense, playmaking, and clutch scoring. Can facilitate for teammates, defend multiple positions, and control pace.",
  "Dennis Smith Jr.": "Athletic guard with driving ability, finishing at the rim, and perimeter defense. Can score in transition and attack closeouts.",
  "Ish Smith": "Point guard with speed, penetration, and passing vision. Can facilitate offense and exploit gaps in transition effectively.",
  "Jalen Smith": "Forward with rebounding, size, and midrange scoring. Can defend multiple positions and rotate effectively in team defense.",
  "Lamar Stevens": "Forward with finishing through contact, rebounding, and defensive versatility. Can set screens and roll effectively in pick-and-rolls.",
  "Isaiah Stewart": "Forward/center with rebounding, interior scoring, physicality, and rim protection. Can set screens and rotate defensively in help schemes.",
  "Max Strus": "Sharpshooting guard with range, off-ball movement, and spacing impact. Can cut efficiently and hit catch-and-shoot opportunities.",
  "Edmond Sumner": "Guard with transition scoring, attacking the rim, and off-ball movement. Can facilitate in secondary playmaking and cut off ball screens.",
  "Jae'Sean Tate": "Forward with defensive versatility, energy, and smart team basketball. Can finish at rim, defend multiple positions, and move off-ball efficiently.",
  "Jayson Tatum": "Forward with elite scoring from all levels, spacing impact, footwork, and two-way ability. Can create for self and others, defend multiple positions, and shoot off the dribble or catch.",
  "Garrett Temple": "Veteran guard with defensive awareness, team IQ, and perimeter spacing. Can cut effectively and provide energy off the ball.",
  "Daniel Theis": "Center with pick-and-roll setting, rim protection, and defensive rotations. Can finish rolls efficiently and defend multiple frontcourt alignments.",
  "Isaiah Thomas": "Guard with scoring instincts, pull-up shooting, and finishing ability. Can create separation and attack off the bounce efficiently.",
  "Klay Thompson": "Guard with elite catch-and-shoot ability, spacing gravity, off-ball movement, and efficient midrange scoring. Can defend wings effectively.",
  "Tristan Thompson": "Forward/center with rebounding, physical interior defense, and pick-and-roll finishing. Can set screens and box out effectively.",
  "Matisse Thybulle": "Wing with elite perimeter defense, on-ball pressure, and help rotations. Can cut and finish in transition and provide spacing gravity.",
  "Xavier Tillman Sr.": "Forward with defensive IQ, rim protection, and effort. Can pass from high and low post, and finish around the rim efficiently.",
  "Obi Toppin": "Forward with athletic finishing, transition scoring, and off-ball movement. Can roll effectively in pick-and-rolls and contribute spacing.",
  "Juan Toscano-Anderson": "Forward with defensive versatility, energy, and hustle. Can guard multiple positions and cut/spread the floor off-ball.",
  "Karl-Anthony Towns": "Center with elite scoring range, post moves, and pick-and-roll versatility. Can space floor, rebound, and protect the rim in team schemes.",
  "Gary Trent Jr.": "Guard with scoring ability, catch-and-shoot range, off-ball movement, and perimeter defense. Can attack closeouts and finish at rim.",
  "P.J. Tucker": "Forward with corner shooting, physical defense, and switchability. Can set screens, cut, and defend multiple positions effectively.",
  "Myles Turner": "Center with elite shot-blocking, floor spacing, pick-and-roll finishing, and defensive rotations. Can protect paint and rebound effectively.",
  "Jonas Valanciunas": "Center with rebounding dominance, post scoring, interior finishing, and pick-and-roll roll execution. Can protect paint and set effective screens.",
  "Fred VanVleet": "Guard with strong shooting, perimeter scoring, pick-and-roll execution, and on-ball defense. Can create for teammates and generate spacing with gravity.",
  "Jarred Vanderbilt": "Forward with elite rebounding, rim protection, help defense, and transition finishing. Provides energy on both ends and effective roll/pop actions.",
  "Devin Vassell": "Wing with smooth shooting, defensive IQ, and off-ball movement. Can switch on defense, space the floor, and cut efficiently in transition.",
  "Gabe Vincent": "Guard with confident perimeter shooting, off-ball movement, and team defense. Can space the floor, hit spot-up threes, and cut in transition.",
  "Noah Vonleh": "Forward with rebounding strength, interior finishing, and physical defense. Can roll in pick-and-rolls and protect the rim in help schemes.",
  "Nikola Vucevic": "Center with scoring versatility, touch in the post, pick-and-pop shooting, and passing from high and low post. Can rebound efficiently and screen effectively.",
  "Dean Wade": "Forward with spacing ability, catch-and-shoot shooting, and team defense. Can cut efficiently, set screens, and contribute on rotations.",
  "Moritz Wagner": "Forward/center with perimeter shooting, spacing ability, and transition finishing. Can defend multiple positions and roll in pick-and-roll schemes.",
  "Kemba Walker": "Point guard with elite ball-handling, midrange scoring, pull-up shooting, and pick-and-roll creation. Can control pace and finish in transition efficiently.",
  "Lonnie Walker IV": "Athletic guard with shooting range, scoring burst off the dribble, and off-ball movement. Can cut, space the floor, and defend multiple positions.",
  "John Wall": "Point guard with elite speed, pick-and-roll execution, finishing at the rim, and playmaking vision. Can push transition and create for teammates effectively.",
  "T.J. Warren": "Forward with midrange scoring, pick-and-roll finishing, and transition attacking ability. Can create separation and score efficiently off the catch.",
  "P.J. Washington": "Forward with spacing, perimeter shooting, pick-and-roll finishing, and defensive versatility. Can defend multiple positions and roll effectively in team schemes.",
  "Yuta Watanabe": "Forward with defensive versatility, help rotations, and catch-and-shoot ability. Can space the floor, move off-ball, and contribute in transition.",
  "Russell Westbrook": "Guard with explosive attacking ability, rim finishing, rebounding, and pick-and-roll creation. Can push and control pace. He also can create for teammates off the bounce.",
  "Coby White": "Guard with speed, pull-up shooting, and off-ball movement. Can attack closeouts, finish in transition, and generate spacing with gravity.",
  "Derrick White": "Guard with defensive versatility, pick-and-roll defense, midrange scoring, and off-ball movement. Can facilitate efficiently and contribute on rotations.",
  "Andrew Wiggins": "Wing with scoring efficiency, off-ball movement, transition finishing, and perimeter defense. Can switch across positions and cut effectively.",
  "Grant Williams": "Forward with defense, pick-and-roll spacing, corner shooting, and physicality. Can move off-ball, set screens, and contribute on rotations.",
  "Kenrich Williams": "Wing with defensive versatility, rebounding, off-ball movement, and pick-and-roll spacing. Can cut and rotate effectively in team concepts.",
  "Patrick Williams": "Forward with defensive versatility, length, athleticism, and rebounding. Can cut, finish at the rim, and provide spacing gravity.",
  "Robert Williams": "Center with elite rim protection, vertical finishing, pick-and-roll rolls, and defensive rotations. Can protect paint and rebound at high level.",
  "Zion Williamson": "Forward with explosive finishing, transition scoring, rim protection, and pick-and-roll rolls. Can create for teammates and space the floor with gravity.",
  "D.J. Wilson": "Forward with floor spacing, pick-and-roll rolls, and perimeter shooting. Can contribute on defensive rotations and cut in transition.",
  "Dylan Windler": "Wing with catch-and-shoot ability, off-ball movement, and rebounding. Can cut efficiently and stretch the floor with shooting gravity.",
  "Justise Winslow": "Forward with defensive versatility, switchability, playmaking from the wing, and transition finishing. Can defend multiple positions and roll in pick-and-rolls.",
  "James Wiseman": "Center with rim-running, shot-blocking, finishing around the basket, and pick-and-roll execution. Can protect paint and rebound effectively.",
  "Christian Wood": "Forward/center with scoring versatility, midrange and inside touch, rebounding, and floor spacing. Can finish in transition and roll in pick-and-rolls.",
  "Delon Wright": "Guard with defensive versatility, pick-and-roll defense, passing vision, and size. Can facilitate offense, move off-ball, and cut efficiently.",
  "Thaddeus Young": "Forward with IQ, screening, rebounding, and secondary playmaking. Can defend multiple positions and contribute efficiently in rotations.",
  "Trae Young": "Guard with deep shooting range, pick-and-roll creation, off-ball movement, and elite vision. Can score from multiple levels and generate spacing for teammates.",
  "Cody Zeller": "Center with screening, rebounding, pick-and-roll finishing, and interior touch. Can protect paint and roll effectively in team schemes.",
  "Ivica Zubac": "Center with rebounding, interior scoring, pick-and-roll finishing, and defensive positioning. Can protect paint and defend multiple frontcourt alignments."
}